//题目：一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？

//#include <stdio.h>
//
//
//int main()
//{
//	
//	int Num = 0;
//	int i = 0;
//	for(i = 2 ; i <= 168/2 ; i++)
//	{
//		if (168 % i == 0)
//		{
//			int j = 168/i;
//			if(i < j && i%2 ==0 && j%2 ==0)
//			{
//				int m = (i+j)/2;
//				int n = (i-j)/2;
//				int x1 = (m*m - 268);
//				int x2 = n*n -100;
//				printf("x(%d) + 100 = %d\n", x2,n*n);
//				printf("x(%d) + 100 + 168 = %d\n", x1,m*m);		
//			}
//
//		}
//	}
//	
//	return 0;
//}
